# ДЗ Бєляєв Михайло


# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:
# st = 'as 23 fdfdg544' введена строка
# 2,3,5,4,4        #вивело в консолі.
# #################################################################################

# a = input("Input string: ")
# result = ''
# for i in a:
#     if i.isdigit():
#         result = result + i
# print(*result, sep=', ')


# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
#   st = 'as 23 fdfdg544 34' #введена строка
#   23, 544, 34              #вивело в консолі
# #################################################################################

# a = input("Input string: ")
# my_list = []
# num = ''
# for i in a:
#     if i.isdigit():
#         num = num + i
#     else:
#         if num != '':
#             my_list.append(num)
#             num = ''
# if num != '':
#     my_list.append(num)
#
# print(', '.join(my_list))

#
# list comprehension
#
# 1)є строка:
# greeting = 'Hello, world'
# записати кожний символ як окремий елемент списку і зробити його заглавним:
# ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']

# greeting = 'Hello, world'
# my_list = [i.upper() for i in greeting]
# print(my_list)

#
# 2) з диапозону від 0-50 записати тільки не парні числа при цьому піднести їх до квадрату
# приклад:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]

# my_list = []
# for i in range(0,50):
#     if i%2 != 0:
#         my_list.append(i**2)
# print(my_list)

#
# function
#
# - створити функцію яка виводить ліст

# def f(x, y, z):
#     return [x, y, z]
#
# a = f(1, 2, 3)
# print(type(a))

# - створити функцію яка приймає три числа та виводить та повертає найбільше.
# def f(x, y, z):
#     print(max(x, y, z))
#     return max(x, y, z)


# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
# def f(*args):
#     print(max(args))
#     return min(args)

# - створити функцію яка повертає найбільше число з ліста
# def f(*args):
#     max_num = max(args)
#     return max_num

# - створити функцію яка повертає найменьше число з ліста
# def f(*args):
#     min_num = min(args)
#     return min_num

# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
# def f(lst, i=None):
#     s = 0
#     for i in lst:
#         print(i)
#         s = s + i
#
#     return s

# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.
# def f(lst, i=None):
#     s = 0
#     for i in lst:
#         print(i)
#         s = s + i
#
#     return s/len(lst)


#
#
#
#
# ################################################################################################
# 1)Дан list:
#   list = [22, 3,5,2,8,2,-23, 8,23,5]
#   - знайти мін число
#   - видалити усі дублікати
#   - замінити кожне 4-те значення на 'X'
# lst = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]

# def f(lst):
#     min_num = min(lst)
#     no_dubl = list(set(lst))
#     for i in range(len(lst)):
#         print(i % 4)
#         if (i + 1) % 4 == 0:
#             lst[i] = 'X'

# 2) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції
# def f(x):
#     for i in range(x):
#         if (i + 1) == 1:
#             print('*' * x)
#         elif i != x:
#             print('*', ' ' * x, '*')
#     print('*' * x)



# 3) вывести табличку множення за допомогою цикла while



# 4) переробити це завдання під меню



